<?php

return [
    'formats' => [
        'table' => 'D, M j, Y h:i A',  // បុព្វសប្ដាហ៍, កក្កដា 23, 2025 01:18 PM (localized via arrays below)
        'short' => 'M j, Y',           // កក្កដា 23, 2025
        'long' => 'l, F j, Y',         // ថ្ងៃពុធ, ខែកក្កដា 23, 2025
    ],
    'months' => [
        1 => 'មករា', 2 => 'កម្ភៈ', 3 => 'មិនា', 4 => 'មេសា',
        5 => 'ឧសភា', 6 => 'មិថុនា', 7 => 'កក្កដា', 8 => 'សីហា',
        9 => 'កញ្ញា', 10 => 'តុលា', 11 => 'វិច្ឆិកា', 12 => 'ធ្នូ'
    ],
    'months_short' => [
        1 => 'មករា', 2 => 'កម្ភៈ', 3 => 'មិនា', 4 => 'មេសា',
        5 => 'ឧសភា', 6 => 'មិថុនា', 7 => 'កក្កដា', 8 => 'សីហា',
        9 => 'កញ្ញា', 10 => 'តុលា', 11 => 'វិច្ឆិកា', 12 => 'ធ្នូ'
    ],
    'weekdays' => [
        0 => 'ថ្ងៃអាទិត្យ', 1 => 'ថ្ងៃច័ន្ទ', 2 => 'ថ្ងៃអង្គារ', 3 => 'ថ្ងៃពុធ',
        4 => 'ថ្ងៃព្រហស្បតិ៍', 5 => 'ថ្ងៃសុក្រ', 6 => 'ថ្ងៃសៅរ៍'
    ],
    'weekdays_short' => [
        0 => 'ថ្ងៃអាទិត្យ', 1 => 'ថ្ងៃច័ន្ទ', 2 => 'ថ្ងៃអង្គារ', 3 => 'ថ្ងៃពុធ',
        4 => 'ថ្ងៃព្រហស្បតិ៍', 5 => 'ថ្ងៃសុក្រ', 6 => 'ថ្ងៃសៅរ៍'
    ]
];
